import React from 'react';
import './App.css';

import Line1 from './graphs/line1'
import Line2 from './graphs/line2'
import Pie1 from './graphs/pie'

import {
  Container,
  H2,
  H3
} from './styles/styles'

function App() {
  return (
    <Container>
      <H2>การใช้จ่ายงบประมาณจังหวัดเชียงใหม่</H2>
      <Line1/>
      <p>&emsp;จาก graph ที่ plot ขึ้นมา จะแสดงให้เห็นว่างบทั้งหมดของจังหวัดเชียงใหม่นั้นมีแนวโน้มโดยเฉลี่ยจะเพิ่มขึ้นในแต่ละปี และจากที่เห็นนั้นจะเห็นได้ชัดเจนว่าปี 2015 จังหวัดเชียงใหม่จะมีงบประมาณรวมเยอะที่สุดเท่าที่เคยได้รับมา</p>
      <Pie1/>
      <p>&emsp;จากกราฟเราจะสามารถบอกได้ว่ามีส่วนของข้อมูลที่ขาดหายไป หรือว่าอาจเป็นเพราะในปีนั้นไม่มีงบมาให้ ซึ่งก็คือปี 2011 (พ.ศ. 2554) แต่โดยภาพรวมแล้วก็สามารถสรุปได้ว่าในแต่ละปีที่ผ่านมามีการเพิ่มขึ้นเรื่อยๆ ของงบที่เข้ามายังกระทรวงศึกษาธิการของเชียงใหม่ และตามที่ขาดไว้ไม่เหมือนกับกราฟแรกก็คือมีปีล่าสุดซึ่งก็คือ 2018 (พ.ศ 2561) ที่มีค่างบประมาณสูงที่สุดถ้าเทียบกับปีอื่นๆ </p>
      <Line2/>
      <p>&emsp;จาก pie chart ข้างบนจะแสดงถึงสัดส่วนของงบที่แต่ละส่วนได้รับไป โดยจะไม่ได้นำมาเทียบกับงบทั้งหมด แต่แค่เอามาเทียบกับส่วนที่เลือกมาทั้งหมด 18 ส่วน ซึ่งจะเห็นได้ว่าจากการเฉลีี่ยงบใน 15 ปี นั้น กระทรวงศึกษาธิการจะได้รับงบมากที่สุด ตามด้วยกระทรวงมหาไทย และกระทรวงคมนาคม</p>
      
      <h4> สรุปผลที่ได้จาก Descriptive Statistic </h4>
      <ol>
        <li>งบทั้งหมดของจังหวัดเชียงใหม่นั้นมีแนวโน้มโดยเฉลี่ยจะเพิ่มขึ้นในแต่ละปี</li>
        <li>ปี 2015 จังหวัดเชียงใหม่จะมีงบประมาณรวมเยอะที่สุดเท่าที่เคยได้รับมา</li>
        <li>จากการเฉลีี่ยงบใน 15 ปี นั้น กระทรวงศึกษาธิการจะได้รับงบมากที่สุด ตามด้วยกระทรวงมหาไทย และกระทรวงคมนาคม</li>
        <li>ในแต่ละปีที่ผ่านมามีการเพิ่มขึ้นเรื่อยๆ ของงบที่เข้ามายังกระทรวงศึกษาธิการของเชียงใหม่</li>
      </ol>

      <H3> จัดทำโดย นายเทพสุนันท์ ลิมปพยอม 5810504451</H3>
      <H3> Data reference: http://www.bb.go.th/budgeting-map1.php?mid=677&gid=506 </H3>

      
    </Container>
  );
}

export default App;
